#Область СлужебныеПроцедурыИФункции

Процедура ЭлементКонтактноеЛицо(Форма) Экспорт

	Имя = Форма.ИмяФормы;
	ЧастиИмени = СтрРазделить(Имя, ".", Ложь);
	Если ЧастиИмени[ЧастиИмени.ВГраница()] = "ФормаДокумента" Тогда
		
		Если ЧастиИмени[1] = "ОплатаОтПокупателя"  Тогда
			ПолеВвода = Форма.Элементы.Вставить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Основание);
			ИначеЕсли ЧастиИмени[1] = "ОплатаПоставщику" Тогда
			ПолеВвода = Форма.Элементы.Вставить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
			Иначе
			ПолеВвода = Форма.Элементы.Добавить("ЭлементКонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		КонецЕсли;
	
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.Нетол_КонтактноеЛицо";			
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти